<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"1304bf322987c8fa3606f5ccb05292c036d17ab712dfc3c873d102f1052e0a6d","plan_job_ref":"Job Test actions using target and replace #478 at https://github.com/dflook/terraform-github-actions/actions/runs/14146261052","plan_out_hash":"4c92648708e57fea4f9478a26baedb7e834c399ce3c1e6d98e8e2c25929b3294","plan_hash":"8f66bda532e8867a610ffb2a007a2fec1917fe90a986641303998b9887b965ad","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "RMCyTlTmu1" -> (known after apply)
!~  foreach = "aRlQbzforb" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #478](https://github.com/dflook/terraform-github-actions/actions/runs/14146261052)